'''
№27
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Дужак Андрій 122-Г
'''
import numpy as np
O = np.zeros(12, dtype=float)
s = 0
n = 0
month = ['Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень',
         "Листопад", "Грудень"]
for i in range(len(O)):
    while True:
        try:
            O[i] = (float(input("Введіть кілкість опадів: ")))
            break
        except ValueError:
            print('Тільки числа!')
    s += O[i]  # К-сть опадів за рік
S = s / len(O)  # Середня к-сть опадів

m = O[0]
mId = 0
for i in range(len(O) - 1):
    if (O[i] < O[i-1]) and (O[i] < m):  # Пошук найменшого елемента
        m = O[i]
        mId = i

for i in range(len(O)):
    if O[i] < 30:  # Посушливі місяці
        n += 1

print(f'Всього випало - {s} мм.\nСередня к-сть опадів - {S:0.3f} мм.\nНайпосушливіший місяць - {month[mId]}\n\
Посушливих місяців - {n}')
