'''
№12
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
Дужак Андрій 122-Г
'''
import numpy as np
import random
t = np.zeros(31, dtype=int)
S = 0
for i in range(len(t)):
    t[i] = (random.randint(-25, 0))  # Заповнення масиву
    S += t[i]  
S /= 31  
k = 0
for i in range(len(t)):
    if t[i] > S:  # Шукаємо температуру вищу за середню
        k += 1
print(f'Днів коли температура була вищою за середню - {k}')
