'''
#38
Дані про направлення вітру (північний, південний, східний, західний) і
силі вітру за декаду листопада зберігаються в масиві. Визначити, скільки днів дув
південний вітер з силою, що перевищує 8 м / с.
Дужак Андрій 122-Г
'''
import numpy as np
import random
n = ['північний', 'південний', 'східний', 'західний', 'північний', 'південний', 'східний', 'західний', 'північний',
     'південний', 'східний', 'західний', 'північний', 'південний', 'східний', 'західний', 'північний', 'південний',
     'східний', 'західний', 'північний', 'південний', 'східний', 'західний', 'північний', 'південний', 'східний',
     'західний', 'північний', 'південний']
f = np.zeros(30, dtype=int)
k = 0
for i in range(len(f)):
    f[i] = (random.randint(0, 20)) 
    if f[i] > 8 and n[i] == 'південний':  # Перевірка умови
        k += 1
print(f'{k} днів дув південний вітер з силою, що перевищує 8 м / с.')
