'''
№ 2
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
Дужак Андрій (122-Г)
'''
import math
import numpy as np # Імпортуємо бібліотеки Math та Numpy
while True:
    a = np.zeros(5, dtype=int) # Заповнюємо нулями
    for i in range(len(a)):
        while True:
            try:
                a[i] = (int(input('Введіть значення: ')))
                break
            except ValueError:
                print('Тільки цілі числа') # Використовуємо функці Try-except для того, щооб у разі виявлення помилки повернути користувача назад, на місце вводу значення, та виведення помилки, яка призвела до переривання циклу

    for i in a:
        print(f'Корінь - {math.sqrt(i):0.2f}, квадрат - {i**2}')

    answer = input("Повторити? так - 1, ні - інше")
    if answer == '1':
        continue
    else:
        break
