'''
№6
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Дужак Андрій 122-Г 
'''
import numpy as np
import random 
while True:
    a = np.zeros(8, dtype=int)
    k = 0
    for i in range(len(a)):
        a[i] = (random.randint(-10, 10))  # Заповнення масиву елеменами у вказаному діапазоні (-10 - +10)
        if a[i] < 0:
            k += 1
    print(a)
    print(f'К-сть елементів, які менші за 0 - {k}')
  
    answer = input("Повторити? так - 1, ні - інше")
    if answer == '1':
        continue
    else:
        break
